04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/vacuumFurnace/constant/fluid/radiationProperties.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  fvDOM;

fvDOM
{
    nPhi        3;
    nTheta      3;
    tolerance   1e-3;
    maxIter     10;
}

solverFreq 1;

absorptionEmissionModel constant;

constant
{
    absorptivity    0;
    emissivity      0;
    E               0;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
